p2p-bench/results/run5/scenarios/affinity_p2p_on-c2/run_1.stdout.txt
WARNING 06-27 07:20:34 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76b66bd4c360>, trust_remote_code=False, seed=1234, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=2, model='affinity_p2p_on-c2', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/affinity_p2p_on-c2', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-894013bc-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 07:20:39 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             2         
Benchmark duration (s):                  757.34    
Total input tokens:                      131072    
Total generated tokens:                  65536     
Request throughput (req/s):              0.04      
Output token throughput (tok/s):         86.53     
Peak output token throughput (tok/s):    40.00     
Peak concurrent requests:                3.00      
Total token throughput (tok/s):          259.60    
---------------Time to First Token----------------
Mean TTFT (ms):                          7083.05   
Median TTFT (ms):                        7673.31   
P50 TTFT (ms):                           7673.31   
P90 TTFT (ms):                           7693.94   
P99 TTFT (ms):                           8852.91   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.49     
Median TPOT (ms):                        18.60     
P50 TPOT (ms):                           18.60     
P90 TPOT (ms):                           22.27     
P99 TPOT (ms):                           36.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           60.94     
Median ITL (ms):                         50.92     
P50 ITL (ms):                            50.92     
P90 ITL (ms):                            51.27     
P99 ITL (ms):                            51.94     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          46972.80  
Median E2EL (ms):                        45954.78  
P50 E2EL (ms):                           45954.78  
P90 E2EL (ms):                           53264.88  
P99 E2EL (ms):                           81376.33  
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:36<04:13, 36.14s/it]
 25%|██▌       | 2/8 [00:41<01:46, 17.82s/it]
 38%|███▊      | 3/8 [01:12<02:00, 24.14s/it]
 50%|█████     | 4/8 [01:21<01:11, 18.00s/it]
 62%|██████▎   | 5/8 [01:49<01:05, 21.80s/it]
 75%|███████▌  | 6/8 [02:03<00:38, 19.12s/it]
 88%|████████▊ | 7/8 [02:26<00:20, 20.30s/it]
100%|██████████| 8/8 [02:33<00:00, 16.05s/it]
100%|██████████| 8/8 [02:33<00:00, 19.19s/it]

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:36<18:51, 36.51s/it]
  6%|▋         | 2/32 [00:47<10:40, 21.35s/it]
  9%|▉         | 3/32 [01:14<11:35, 23.98s/it]
 12%|█▎        | 4/32 [01:28<09:26, 20.25s/it]
 16%|█▌        | 5/32 [01:54<10:01, 22.26s/it]
 19%|█▉        | 6/32 [02:04<07:49, 18.06s/it]
 22%|██▏       | 7/32 [02:40<09:58, 23.94s/it]
 25%|██▌       | 8/32 [02:54<08:19, 20.81s/it]
 28%|██▊       | 9/32 [03:25<09:09, 23.89s/it]
 31%|███▏      | 10/32 [03:47<08:35, 23.43s/it]
 34%|███▍      | 11/32 [04:10<08:08, 23.25s/it]
 38%|███▊      | 12/32 [04:42<08:38, 25.91s/it]
 41%|████      | 13/32 [04:57<07:09, 22.58s/it]
 44%|████▍     | 14/32 [05:31<07:48, 26.05s/it]
 47%|████▋     | 15/32 [05:44<06:16, 22.16s/it]
 50%|█████     | 16/32 [06:19<06:53, 25.82s/it]
 53%|█████▎    | 17/32 [06:33<05:35, 22.35s/it]
 56%|█████▋    | 18/32 [07:01<05:36, 24.02s/it]
 59%|█████▉    | 19/32 [07:15<04:32, 21.00s/it]
 62%|██████▎   | 20/32 [07:47<04:51, 24.30s/it]
 66%|██████▌   | 21/32 [08:03<04:00, 21.89s/it]
 69%|██████▉   | 22/32 [08:39<04:19, 25.98s/it]
 72%|███████▏  | 23/32 [08:51<03:17, 21.98s/it]
 75%|███████▌  | 24/32 [09:22<03:16, 24.53s/it]
 78%|███████▊  | 25/32 [09:42<02:43, 23.34s/it]
 81%|████████▏ | 26/32 [10:04<02:17, 22.87s/it]
 84%|████████▍ | 27/32 [10:25<01:51, 22.33s/it]
 88%|████████▊ | 28/32 [10:57<01:41, 25.30s/it]
 91%|█████████ | 29/32 [11:07<01:01, 20.51s/it]
 94%|█████████▍| 30/32 [11:48<00:53, 26.69s/it]
 97%|█████████▋| 31/32 [12:26<00:30, 30.03s/it]
100%|██████████| 32/32 [12:37<00:00, 24.40s/it]
100%|██████████| 32/32 [12:37<00:00, 23.67s/it]